back/app/controllers/applications_controller.rb

  def index
    @applications = Application.all
---
SELECT "applications".* FROM "applications"

  def create
    @application = Application.new(application_params)

    if @application.save
---
INSERT INTO "applications" ("name", "author", "version", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "My App"], ["author", "McCullough Group"], ["version", "10.0.1"], ["created_at", "2019-07-23 20:33:40.973114"], ["updated_at", "2019-07-23 20:33:40.973114"]]

  def update
    if @application.update(application_params)
---
UPDATE "applications" SET "version" = ?, "updated_at" = ? WHERE "applications"."id" = ?  [["version", "10.0.2"], ["updated_at", "2019-07-23 20:37:05.568318"], ["id", 151]]

  def destroy
    @application.destroy
---
DELETE FROM "applications" WHERE "applications"."id" = ?  [["id", 151]]